mongo/6node/load-f.log
Loading workload...
Starting test.
2024-04-10 18:07:49:590 0 sec: 0 operations; est completion in 0 second 
mongo client connection created with mongodb://10.142.0.4:27018/ycsb
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2024-04-10 18:07:55:618 6 sec: 1000 operations; 163.21 current ops/sec; [CLEANUP: Count=1, Max=3783, Min=3782, Avg=3783, 90=3783, 99=3783, 99.9=3783, 99.99=3783] [INSERT: Count=1000, Max=212095, Min=3234, Avg=5125.31, 90=6299, 99=8679, 99.9=14511, 99.99=212095] 
[OVERALL], RunTime(ms), 6133
[OVERALL], Throughput(ops/sec), 163.05233980107616
[TOTAL_GCS_G1_Young_Generation], Count, 4
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 48
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.7826512310451654
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 4
[TOTAL_GC_TIME], Time(ms), 48
[TOTAL_GC_TIME_%], Time(%), 0.7826512310451654
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 3783.0
[CLEANUP], MinLatency(us), 3782
[CLEANUP], MaxLatency(us), 3783
[CLEANUP], 95thPercentileLatency(us), 3783
[CLEANUP], 99thPercentileLatency(us), 3783
[INSERT], Operations, 1000
[INSERT], AverageLatency(us), 5125.307
[INSERT], MinLatency(us), 3234
[INSERT], MaxLatency(us), 212095
[INSERT], 95thPercentileLatency(us), 6823
[INSERT], 99thPercentileLatency(us), 8679
[INSERT], Return=OK, 1000